Repository: juntjtang18/GeniusParentingAISwift
Catalog: GeniusParentingAISwift/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Add a comment...
zh_hans: 添加评论…

source: Add Child
zh_hans: 添加孩子

source: Age:
zh_hans: 年龄：

# Age: %lld | Gender: %@
source: Age: %1$lld | Gender: %2$@
zh_hans: 年龄：%1$lld | 性别：%2$@

source: Agree to Terms of Service, Privacy Policy, and Community Guidelines
zh_hans: 同意服务条款、隐私政策和社区准则

source: AI Assistant
zh_hans: AI助手

source: Already have an account? Login
zh_hans: 已有账户？登录

source: Are you sure?
zh_hans: 你确定吗？

source: Ask a parenting question...
zh_hans: 提出父母相关问题…

source: Back
zh_hans: 返回

source: Block this user?
zh_hans: 屏蔽此用户？

source: Block User
zh_hans: 屏蔽用户

source: Blocked Users
zh_hans: 被屏蔽的用户

source: By accessing or using our Website, you agree to comply with and be bound by these Terms. If you do not agree with any part of these Terms, please do not use our Website.
zh_hans: 通过访问或使用我们的网站，即表示您同意遵守这些条款并受其约束。如果您不同意这些条款的任何部分，请不要使用我们的网站。

source: By signing up, the user agrees to the [Terms of Service](%1$@), [Privacy Policy](%2$@), and [Community Guidelines](%3$@).
zh_hans: 注册即表示用户同意[服务条款](%1$@)、[隐私政策](%2$@)和[社区指南](%3$@)。

source: Cancel
zh_hans: 取消

source: Checking Login Status...
zh_hans: 检查登录状态...

source: Child's Name
zh_hans: 孩子的名字

source: Close
zh_hans: 关闭

source: Comment
zh_hans: 评论

source: Comments
zh_hans: 评论

source: Community
zh_hans: 社区

source: Community Guidelines
zh_hans: 社区指南

source: Course
zh_hans: 课程

source: Course data not found.
zh_hans: 课程数据未找到。

source: Courses
zh_hans: 课程

source: Current Plan
zh_hans: 当前订购

source: Daily Tips
zh_hans: 每日提示

source: Data Options
zh_hans: 数据选项

source: Delete Account
zh_hans: 删除账户

source: Delete My Account
zh_hans: 删除我的账户

source: Details (optional)
zh_hans: 详细信息（可选）

source: Don't have an account? Sign Up
zh_hans: 还没有账户？注册

source: Done
zh_hans: 完成

source: Easy steps to guide parents through
zh_hans: 引导家长的简单步骤

source: Edit
zh_hans: 编辑

source: Edit Profile
zh_hans: 编辑个人资料

source: Effective Date: July 12, 2025
zh_hans: 生效日期：2025年7月12日

source: Email
zh_hans: 电子邮件

source: Email Notifications
zh_hans: 电子邮件通知

source: English
zh_hans: 英语

source: Error
zh_hans: 错误

source: Error: %@
zh_hans: 错误：%@

source: Error: Invalid backend URL
zh_hans: 错误：无效的后端网址

source: Everything parents need, in one place
zh_hans: 一切家长所需，尽在一处

source: Failed to load questions
zh_hans: 加载问题失败

source: Family Information
zh_hans: 家庭信息

source: Features
zh_hans: 特性

source: Features:
zh_hans: 功能：

source: Female
zh_hans: 女性

source: Gender
zh_hans: 性别

source: Got it!
zh_hans: 明白了！

source: Great! Let's get to know you better. This will only take 30 seconds.
zh_hans: 太好了！让我们更好地了解你。这只需30秒。

source: Hello! How can I help you with your parenting questions today?
zh_hans: 你好！今天我怎样帮助你解决育儿问题呢？

source: Hide Keyboard
zh_hans: 隐藏键盘

source: Home
zh_hans: 首页

source: Hot Topics
zh_hans: 热点话题

source: Image failed to load
zh_hans: 图像加载失败

source: Invalid Image URL
zh_hans: 无效的图片URL

source: Invalid Video URL
zh_hans: 无效的视频网址

source: Know me Better
zh_hans: 更了解我

source: Last Updated: February 23, 2025
zh_hans: 最后更新：2025年2月23日

source: Load more comments
zh_hans: 加载更多评论

source: Loading Categories...
zh_hans: 正在加载类别...

source: Loading comments...
zh_hans: 正在加载评论...

source: Loading Community...
zh_hans: 加载社区...

source: Loading Course...
zh_hans: 加载课程...

source: Loading Plans...
zh_hans: 加载计划...

source: Loading Profile...
zh_hans: 正在加载配置文件…

source: Loading questions…
zh_hans: 正在加载问题…

source: Loading Topic...
zh_hans: 正在加载主题...

source: Login
zh_hans: 登录

source: Logout
zh_hans: 退出登录

source: Male
zh_hans: 男性

source: Manage Subscription
zh_hans: 管理订阅

source: Maybe Later
zh_hans: 也许以后吧

source: Membership Required
zh_hans: 需要会员资格

source: New Post
zh_hans: 新帖

source: No blocked users
zh_hans: 没有被屏蔽的用户

source: No child details added.
zh_hans: 未添加子详细信息。

source: No comments yet.
zh_hans: 暂无评论。

source: No content for this course.
zh_hans: 这门课程没有内容。

source: No content for this topic.
zh_hans: 此主题没有内容。

source: No courses available.
zh_hans: 暂无课程。

source: No lessons for today.
zh_hans: 今天没有课程。

source: No personality result saved yet.
zh_hans: 尚未保存性格结果。

source: No profile data available.
zh_hans: 没有可用的个人资料数据。

source: No profile details found. Please complete your profile.
zh_hans: 未找到个人资料详细信息。请完善个人资料。

source: No questions available.
zh_hans: 没有可用的问题。

source: Not now
zh_hans: 现在不行

source: OK
zh_hans: 好的

# Page %lld of %lld
source: Page %1$lld of %2$lld
zh_hans: 第 %1$lld 页，共 %2$lld 页

source: Parent Genius AI ("we," "our," or "us") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, and safeguard your information when you use our website and iPhone app (the "Services"). By using our Services, you agree to the practices described in this Privacy Policy.
zh_hans: Parent Genius AI（“我们”）致力于保护您的隐私。本隐私政策说明了我们如何在您使用我们的网站和iPhone应用程序（“服务”）时收集、使用和保护您的信息。使用我们的服务即表示您同意本隐私政策中描述的做法。

source: Password
zh_hans: 密码

source: Personality Profile
zh_hans: 性格简介

source: Please log in to view your profile.
zh_hans: 请登录以查看您的个人资料。

source: Post
zh_hans: 帖子

source: Posting...
zh_hans: 发布中...

source: Preferences
zh_hans: 偏好设置

source: Privacy Policy
zh_hans: 隐私政策

source: Processing...
zh_hans: 处理中...

source: Profile
zh_hans: 个人资料

source: Purchase Failed
zh_hans: 购买失败

source: Purchase Successful
zh_hans: 购买成功

source: Reason
zh_hans: 原因

source: REFRESH mode
zh_hans: 刷新模式

source: Report Comment
zh_hans: 报告评论

source: Report Post
zh_hans: 举报帖子

source: Retake Personality Test
zh_hans: 重测性格测试

source: Retry
zh_hans: 重试

source: Save
zh_hans: 保存

source: Saving…
zh_hans: 保存中…

source: Search
zh_hans: 搜索

source: Search Courses
zh_hans: 搜索课程

source: See All
zh_hans: 查看全部

source: Select a Theme
zh_hans: 选择主题

source: Select Language
zh_hans: 选择语言

source: Select Photos
zh_hans: 选择照片

source: Settings
zh_hans: 设置

source: Sign Up
zh_hans: 注册

source: Simple guidance every step of the way.
zh_hans: 每一步都有简单指导。

source: Skip
zh_hans: 跳过

source: Skip Test >
zh_hans: 跳过测试 >

source: Spanish
zh_hans: 西班牙语

source: Start Personality Test
zh_hans: 开始性格测试

source: Submit Report
zh_hans: 提交报告

source: Subscribe
zh_hans: 订阅

source: Subscribe for %@
zh_hans: 订阅%@

source: Subscribe Now
zh_hans: 立即订阅

source: Subscription
zh_hans: 订阅

source: Subscription Plans
zh_hans: 订阅计划

source: Take the test
zh_hans: 参加测试

source: Tap to explore
zh_hans: 轻触以探索

source: Terms of Service
zh_hans: 服务条款

source: Terms of Use
zh_hans: 使用条款

source: Thank you for trusting Parent Genius AI. We are committed to empowering parents while respecting your privacy.
zh_hans: 感谢您信任Parent Genius AI。我们致力于在尊重您隐私的同时增强家长的能力。

source: The correct answer is: **%@**
zh_hans: 正确答案是：**%@**

source: This course is only available to members. Subscribe now to unlock this and all other exclusive content!
zh_hans: 此课程仅对会员开放。立即订阅以解锁此课程和所有其他独家内容！

source: This course requires a membership to access.
zh_hans: 本课程需要会员资格才能访问。

source: This helps tailor tips and lessons to you.
zh_hans: 这有助于为您量身定制建议和课程。

source: This will control data refreshing behavior in a future update.
zh_hans: 这将在未来的更新中控制数据刷新行为。

source: Tips
zh_hans: 提示

source: To change your result, retake the personality test.
zh_hans: 要更改结果，请重新进行性格测试。

source: Topic data not found.
zh_hans: 未找到主题数据。

source: Try the 30-sec Personality Test?
zh_hans: 尝试30秒人格测试？

source: Unblock
zh_hans: 解除阻止

source: Unblock @%@?
zh_hans: 解除屏蔽@%@?

source: Unlock exclusive courses
zh_hans: 解锁独家课程

source: Unlock Full Access
zh_hans: 解锁完整访问权限

source: Unsupported component: %@
zh_hans: 不支持的组件：%@

source: User Name
zh_hans: 用户名

source: User unblocked
zh_hans: 用户已解锁

source: Username
zh_hans: 用户名

source: Video could not be loaded.
zh_hans: 无法加载视频。

source: View all %lld comments
zh_hans: 查看全部%lld条评论

source: Welcome back
zh_hans: 欢迎回来

source: Welcome to Genius Parenting
zh_hans: 欢迎来到天才育儿

source: Welcome to Genius Parenting AI ("we," "our," or "us"). These Terms of Service ("Terms") govern your access to and use of our website, https://www.geniusparentingAI.ca (the "Website"), and any services, content, and features provided by GNM399 Ventures Corp.
zh_hans: 欢迎使用Genius Parenting AI（“我们”）。这些服务条款（“条款”）管理您对我们网站 https://www.geniusparentingAI.ca（“网站”）的访问和使用，以及对由GNM399 Ventures Corp.提供的任何服务、内容和功能的使用。

source: Your account and all associated data will be permanently deleted. This action is irreversible.
zh_hans: 您的账户和所有相关数据将被永久删除。此操作不可逆。

source: Your AI-powered partner in building trust, love, and resilience in parenting.
zh_hans: 您的AI驱动伙伴，助您在养育中建立信任、爱和韧性。

source: Your Courses
zh_hans: 您的课程

source: Your courses to match your style
zh_hans: 您的课程以匹配您的风格

source: Your new plan is now active!
zh_hans: 您的新计划现已生效！

source: Your Power Tip:
zh_hans: 您的强力提示：
